hrconsole/app/views/leads/show.html.erb

SELECT "skills".* FROM "skills" INNER JOIN "employees_skills" ON "skills"."id" = "employees_skills"."skill_id" WHERE "employees_skills"."employee_id" = ?  [["employee_id", 4]]
SELECT COUNT(*) FROM "skills" INNER JOIN "employees_skills" ON "skills"."id" = "employees_skills"."skill_id" WHERE "employees_skills"."employee_id" = ?  [["employee_id", 4]]
---
    <tr>
      <td> <%= employee.name %> </td> <td> <%= employee.skills.count %> </td>