hrconsole/app/controllers/skills_controller.rb

INSERT INTO "skills" ("skill", "created_at", "updated_at") VALUES (?, ?, ?)  [["skill", "C Programming"], ["created_at", "2017-06-19 06:06:01.398292"], ["updated_at", "2017-06-19 06:06:01.398292"]]
---
  def create
    @skill = Skill.new(skill_params)
    @skill.save

SELECT  "skills".* FROM "skills" WHERE "skills"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @skill = Skill.find(params[:id])